name: "logistic_regression_with_affine"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 28
  dim: 28
}

layer{
  name: "warp_angle_raw"
  type: "InnerProduct"
  bottom: "data"
  top: "warp_angle_raw"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer{
  name: "warp_angle"
  type: "TanH"
  bottom: "warp_angle_raw"
  top: "warp_angle"
}

layer{
  name: 'warp_data'
  type: 'Python'
  top: 'warp_data'
  bottom: 'warp_angle'
  bottom: 'data'
  python_param {
    module: 'warp_affine_layer.layer'
    layer: 'WarpAffineLayer'
  }
}

layer {
  name: "cls_score"
  type: "InnerProduct"
  bottom: "warp_data"
  top: "cls_score"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "cls_prob"
  type: "Softmax"
  bottom: "cls_score"
  top: "cls_prob"
}
