name: "AIM_NETWORK_ACTIVE_LEARNING"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 32
  dim: 32
}
input: "avImage"
input_shape {
  dim: 1
  dim: 4
  dim: 250
  dim: 250
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

# -==-=--=-=-=-=-=-=-=-=-

layer {
  name: "conv1_1_av"
  type: "Convolution"
  bottom: "avImage"
  top: "conv1_1_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_1_av"
  type: "ReLU"
  bottom: "conv1_1_av"
  top: "conv1_1_av"
}
layer {
  name: "conv1_2_av"
  type: "Convolution"
  bottom: "conv1_1_av"
  top: "conv1_2_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu1_2_av"
  type: "ReLU"
  bottom: "conv1_2_av"
  top: "conv1_2_av"
}
layer {
  name: "pool1_av"
  type: "Pooling"
  bottom: "conv1_2_av"
  top: "pool1_av"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1_av"
  type: "Convolution"
  bottom: "pool1_av"
  top: "conv2_1_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_1_av"
  type: "ReLU"
  bottom: "conv2_1_av"
  top: "conv2_1_av"
}
layer {
  name: "conv2_2_av"
  type: "Convolution"
  bottom: "conv2_1_av"
  top: "conv2_2_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu2_2_av"
  type: "ReLU"
  bottom: "conv2_2_av"
  top: "conv2_2_av"
}
layer {
  name: "pool2_av"
  type: "Pooling"
  bottom: "conv2_2_av"
  top: "pool2_av"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1_av"
  type: "Convolution"
  bottom: "pool2_av"
  top: "conv3_1_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_1_av"
  type: "ReLU"
  bottom: "conv3_1_av"
  top: "conv3_1_av"
}
layer {
  name: "conv3_2_av"
  type: "Convolution"
  bottom: "conv3_1_av"
  top: "conv3_2_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_2_av"
  type: "ReLU"
  bottom: "conv3_2_av"
  top: "conv3_2_av"
}
layer {
  name: "conv3_3_av"
  type: "Convolution"
  bottom: "conv3_2_av"
  top: "conv3_3_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu3_3_av"
  type: "ReLU"
  bottom: "conv3_3_av"
  top: "conv3_3_av"
}
layer {
  name: "pool3_av"
  type: "Pooling"
  bottom: "conv3_3_av"
  top: "pool3_av"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1_av"
  type: "Convolution"
  bottom: "pool3_av"
  top: "conv4_1_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv4_2_av"
  type: "Convolution"
  bottom: "conv4_1_av"
  top: "conv4_2_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_2_av"
  type: "ReLU"
  bottom: "conv4_2_av"
  top: "conv4_2_av"
}
layer {
  name: "conv4_3_av"
  type: "Convolution"
  bottom: "conv4_2_av"
  top: "conv4_3_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu4_3_av"
  type: "ReLU"
  bottom: "conv4_3_av"
  top: "conv4_3_av"
}
layer {
  name: "pool4_av"
  type: "Pooling"
  bottom: "conv4_3_av"
  top: "pool4_av"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1_av"
  type: "Convolution"
  bottom: "pool4_av"
  top: "conv5_1_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_1_av"
  type: "ReLU"
  bottom: "conv5_1_av"
  top: "conv5_1_av"
}
layer {
  name: "conv5_2_av"
  type: "Convolution"
  bottom: "conv5_1_av"
  top: "conv5_2_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_2_av"
  type: "ReLU"
  bottom: "conv5_2_av"
  top: "conv5_2_av"
}
layer {
  name: "conv5_3_av"
  type: "Convolution"
  bottom: "conv5_2_av"
  top: "conv5_3_av"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "relu5_3_av"
  type: "ReLU"
  bottom: "conv5_3_av"
  top: "conv5_3_av"
}
layer {
  name: "pool5_av"
  type: "Pooling"
  bottom: "conv5_3_av"
  top: "pool5_av"
  pooling_param {
    pool: MAX
    kernel_size: 4
    stride: 4
  }
}
layer{
  name: "junction"
  type: "Concat"
  bottom: "pool3"
  bottom: "pool5_av"
  top: "junction"
  concat_param{
     axis: 1
  }
}  
layer {
  name: "fc6_av"
  type: "InnerProduct"
  bottom: "junction"
  top: "fc6"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_av"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
  propagate_down: 1
}
layer {
  name: "cls_score"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  propagate_down: 1
}
layer {
  name: "makeSlience"
  type: "Silence"
  bottom: "pool4"
}
layer {
  name: "cls_prob"
  type: "Sigmoid"
  bottom: "cls_score"
  top: "cls_prob"
}


